export const chartdata = [
    {
        date: 'Янв 22',
        'Проект 1': 289000,
        'Проект 2': 233800,
    },
    {
        date: 'Февр 22',
        'Проект 1': 275600,
        'Проект 2': 210300,
    },
    {
        date: 'Март 22',
        'Проект 1': 332200,
        'Проект 2': 219400,
    },
    {
        date: 'Апр 22',
        'Проект 1': 347000,
        'Проект 2': 210800,
    },
    {
        date: 'Май 22',
        'Проект 1': 347500,
        'Проект 2': 181200,
    },
    {
        date: 'Июнь 22',
        'Проект 1': 312900,
        'Проект 2': 172600,
    },
    {
        date: 'Июль 22',
        'Проект 1': 349000,
        'Проект 2': 198200,
    },
    {
        date: 'Авг 22',
        'Проект 1': 290300,
        'Проект 2': 201200,
    },
    {
        date: 'Сен 22',
        'Проект 1': 264300,
        'Проект 2': 234200,
    },
    {
        date: 'Окт 22',
        'Проект 1': 283700,
        'Проект 2': 247300,
    },
    {
        date: 'Нояб 22',
        'Проект 1': 295400,
        'Проект 2': 384800,
    },
    {
        date: 'Дек 22',
        'Проект 1': 323900,
        'Проект 2': 373600,
    },
];

export const barChartData = [
    {
        name: 'Аналитики',
        'Команда A': 890,
        'Команда B': 338,
        'Команда C': 538,
        'Команда D': 396,
        'Команда E': 138,
        'Команда F': 436,
    },
    {
        name: 'Дата-инженеры',
        'Команда A': 289,
        'Команда B': 233,
        'Команда C': 253,
        'Команда D': 333,
        'Команда E': 133,
        'Команда F': 533,
    },
    {
        name: 'JS-разработчики',
        'Команда A': 380,
        'Команда B': 535,
        'Команда C': 352,
        'Команда D': 718,
        'Команда E': 539,
        'Команда F': 234,
    },
    {
        name: 'Тестировщики',
        'Команда A': 90,
        'Команда B': 98,
        'Команда C': 28,
        'Команда D': 33,
        'Команда E': 61,
        'Команда F': 53,
    },
];

export const donutData = [
    {
        name: 'DevOps-инженеры',
        sales: 54,
    },
    {
        name: 'Аналитики',
        sales: 39,
    },
    {
        name: 'Дата-инженеры',
        sales: 93,
    },
    {
        name: 'JS-разработчики',
        sales: 52,
    },
    {
        name: 'Тестировщики',
        sales: 14,
    },
];

export const barListData = [
    { name: 'JavaScript', value: 456 },
    { name: 'C++', value: 210 },
    { name: 'Python', value: 391 },
    { name: 'TypeScript', value: 183 },
    { name: 'Go', value: 89 },
    { name: 'Rust', value: 69 },
];
